test/testData/dummy_payment_refunds.json

{
    "total_count": 2,
    "object": "list",
    "data": [
      {
        "id": "rfnd_02iOL6yHtrTTVYSw",
        "object": "refund",
        "amount": 200,
        "currency": "INR",
        "payment_id": "dummy_payment_id",
        "notes": {
          "item_count": "2",
          "sales_channel": "website"
        },
        "created_at": 1495554728
      },
      {
        "id": "rfnd_iqPqyu7Ds5UaC434",
        "object": "refund",
        "amount": 200,
        "currency": "INR",
        "payment_id": "dummy_payment_id",
        "notes": {
          "item_count": "2",
          "sales_channel": "website"
        },
        "created_at": 1495547054
      }
    ]
  }